Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/edc/ATSAML22J16A.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x4200281C" edc:cname="CC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="RTC/MODE0">
      <edc:SFRDef edc:access="nnn-nnnnn---nnnn" edc:addr="0x40002400" edc:cname="CTRLA" edc:impl="0xEF8F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Mode 0: 32-bit Counter" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Mode 1: 16-bit Counter" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK" edc:desc="Mode 2: Clock/Calendar" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MATCHCLR" edc:desc="Clear on Match" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_CNT = GCLK_RTC/2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_CNT = GCLK_RTC/4" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_CNT = GCLK_RTC/8" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_CNT = GCLK_RTC/16" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_CNT = GCLK_RTC/32" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_CNT = GCLK_RTC/64" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_CNT = GCLK_RTC/128" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_CNT = GCLK_RTC/256" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="CLK_RTC_CNT = GCLK_RTC/512" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_RTC_CNT = GCLK_RTC/1024" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BKTRST" edc:desc="BKUP Registers Reset On Tamper Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GPTRST" edc:desc="GP Registers Reset On Tamper Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTSYNC" edc:desc="Count Read Synchronization Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x40002420" edc:cname="COMP" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COMP" edc:desc="Compare Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnn-nnnnnnn---n" edc:addr="0x40002402" edc:cname="CTRLB" edc:impl="0x77F1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP0EN" edc:desc="General Purpose 0 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DEBMAJ" edc:desc="Debouncer Majority Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBASYNC" edc:desc="Debouncer Asynchronous Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCOUT" edc:desc="RTC Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="DMA Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBF" edc:desc="Debounce Freqnuency" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_DEB = CLK_RTC/2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_DEB = CLK_RTC/4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_DEB = CLK_RTC/8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_DEB = CLK_RTC/16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_DEB = CLK_RTC/32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_DEB = CLK_RTC/64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_DEB = CLK_RTC/128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_DEB = CLK_RTC/256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTF" edc:desc="Active Layer Freqnuency" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_OUT = CLK_RTC/2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_OUT = CLK_RTC/4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_OUT = CLK_RTC/8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_OUT = CLK_RTC/16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_OUT = CLK_RTC/32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_OUT = CLK_RTC/64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_OUT = CLK_RTC/128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_OUT = CLK_RTC/256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------nnn-----nnnnnnnnn" edc:addr="0x40002404" edc:cname="EVCTRL" edc:impl="0x1C1FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PEREO0" edc:desc="Periodic Interval 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO1" edc:desc="Periodic Interval 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO2" edc:desc="Periodic Interval 2 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO3" edc:desc="Periodic Interval 3 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO4" edc:desc="Periodic Interval 4 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO5" edc:desc="Periodic Interval 5 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO6" edc:desc="Periodic Interval 6 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEREO7" edc:desc="Periodic Interval 7 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPEO0" edc:desc="Compare 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TAMPEREO" edc:desc="Tamper Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:desc="Overflow Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPEVEI" edc:desc="Tamper Event Input Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:addr="0x40002464" edc:cname="TIMESTAMP" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Count Timestamp Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
